RT-Thread/rt-thread/bsp/hc32f480/libraries/mcu/EWARM/startup_hc32f480.s
                PUBWEAK IRQ038_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ038_Handler
                B       IRQ038_Handler
                
                PUBWEAK IRQ039_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ039_Handler
                B       IRQ039_Handler
                
                PUBWEAK IRQ040_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ040_Handler
                B       IRQ040_Handler
                
                PUBWEAK IRQ041_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ041_Handler
                B       IRQ041_Handler
                
                PUBWEAK IRQ042_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ042_Handler
                B       IRQ042_Handler
                
                PUBWEAK IRQ043_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ043_Handler
                B       IRQ043_Handler
                
                PUBWEAK IRQ044_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ044_Handler
                B       IRQ044_Handler
                
                PUBWEAK IRQ045_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ045_Handler
                B       IRQ045_Handler
                
                PUBWEAK IRQ046_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ046_Handler
                B       IRQ046_Handler
                
                PUBWEAK IRQ047_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ047_Handler
                B       IRQ047_Handler
                
                PUBWEAK IRQ048_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ048_Handler
                B       IRQ048_Handler
                
                PUBWEAK IRQ049_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ049_Handler
                B       IRQ049_Handler
                
                PUBWEAK IRQ050_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ050_Handler
                B       IRQ050_Handler
                
                PUBWEAK IRQ051_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ051_Handler
                B       IRQ051_Handler
                
                PUBWEAK IRQ052_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ052_Handler
                B       IRQ052_Handler
                
                PUBWEAK IRQ053_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ053_Handler
                B       IRQ053_Handler
                
                PUBWEAK IRQ054_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ054_Handler
                B       IRQ054_Handler
                
                PUBWEAK IRQ055_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ055_Handler
                B       IRQ055_Handler
                
                PUBWEAK IRQ056_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ056_Handler
                B       IRQ056_Handler
                
                PUBWEAK IRQ057_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ057_Handler
                B       IRQ057_Handler
                
                PUBWEAK IRQ058_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ058_Handler
                B       IRQ058_Handler
                
                PUBWEAK IRQ059_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ059_Handler
                B       IRQ059_Handler
                
                PUBWEAK IRQ060_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ060_Handler
                B       IRQ060_Handler
                
                PUBWEAK IRQ061_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ061_Handler
                B       IRQ061_Handler
                
                PUBWEAK IRQ062_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ062_Handler
                B       IRQ062_Handler
                
                PUBWEAK IRQ063_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ063_Handler
                B       IRQ063_Handler
                
                PUBWEAK IRQ064_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ064_Handler
                B       IRQ064_Handler
                
                PUBWEAK IRQ065_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ065_Handler
                B       IRQ065_Handler
                
                PUBWEAK IRQ066_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ066_Handler
                B       IRQ066_Handler
                
                PUBWEAK IRQ067_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ067_Handler
                B       IRQ067_Handler
                
                PUBWEAK IRQ068_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ068_Handler
                B       IRQ068_Handler
                
                PUBWEAK IRQ069_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ069_Handler
                B       IRQ069_Handler
                
                PUBWEAK IRQ070_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ070_Handler
                B       IRQ070_Handler
                
                PUBWEAK IRQ071_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ071_Handler
                B       IRQ071_Handler
                
                PUBWEAK IRQ072_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ072_Handler
                B       IRQ072_Handler
                
                PUBWEAK IRQ073_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ073_Handler
                B       IRQ073_Handler
                
                PUBWEAK IRQ074_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ074_Handler
                B       IRQ074_Handler
                
                PUBWEAK IRQ075_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ075_Handler
                B       IRQ075_Handler
                
